// ======================================================================
// Oni_Net_Support.c
// ======================================================================

// ======================================================================
// includes
// ======================================================================
#include "BFW.h"
#include "BFW_TemplateManager.h"
#include "BFW_Console.h"
#include "BFW_MathLib.h"
#include "BFW_Totoro.h"

#include "Oni.h"
#include "Oni_Camera.h"
#include "Oni_Networking.h"
#include "Oni_Net_Support.h"
#include "Oni_GameState.h"
#include "Oni_AI_Setup.h"
#include "Oni_Level.h"
#include "Oni_Weapon.h"
#include "Oni_Character_Animation.h"

// ======================================================================
// defines
// ======================================================================
#define ONcNet_SwapIt			'SI'

#define ONcNet_DataType_Length	sizeof(ONtNet_DataType)

#define ONcNet_FindServer_Broadcast_Interval	(5 * 60) /* in ticks */

#define ONcNet_InventoryBits	(LIc_BitMask_Swap | LIc_BitMask_Drop | LIc_BitMask_Hypo | LIc_BitMask_Reload)

// ----------------------------------------------------------------------
#define ONmNet_AddDataType(data_type,dest_data)							\
	*(ONtNet_DataType*)dest_data = data_type;							\
	(ONtNet_DataType*)dest_data += ONcNet_DataType_Length;

#define ONmNet_GetDataType(src_data, data_type)							\
	data_type = *((ONtNet_DataType*)src_data);							\
	src_data += ONcNet_DataType_Length;
	

	update_data += sizeof(type);

#define ONmNet_Update2(type, var, data)									\
	var = *(type*)data;													\
	data += sizeof(type);

#define ONmNet_SwapUpdate2Byte(type, var, data, swap_it)				\
	ONmNet_Update2(type, var, data);									\
	if (swap_it) { UUrSwap_2Byte(&var); }

#define ONmNet_SwapUpdate4Byte(type, var, data, swap_it)				\
	ONmNet_Update2(type, var, data);									\
	if (swap_it) { UUrSwap_4Byte(&var); }

#define ONmNet_SwapUpdateFunc(type, var, data, swap_it, swap_func)		\
	ONmNet_Update2(type, var, data);									\
	if (swap_it) { swap_func(var); }

// ----------------------------------------------------------------------
#if defined(DEBUGGING) && DEBUGGING

#define ONmNet_CheckByteAlignment(adr)									\
	UUmAssert((((UUtUns32)adr) & 3) == 0);

#else

#define ONmNet_CheckByteAlignment(adr)

#endif

// ======================================================================
// globals
// ======================================================================
static M3tPoint3D				ONgNet_WeaponPosition[WPcMaxWeapons];

// ======================================================================
// enums
// ======================================================================
enum
{
	ONcNone,						// this starts the count
	
	// Client to Server ACKs
	ONcC2S_ACK_Critical_Update,
	ONcC2S_ACK_Weapon_Update,
	
	// Client to Server Heartbeat
	ONcC2S_Heartbeat,
	
	// Client to Server Requests
	ONcC2S_Request_CharacterCreate,
	ONcC2S_Request_CharacterInfo,
	ONcC2S_Request_Join,
	ONcC2S_Request_Spawn,
	ONcC2S_Request_Quit,
	ONcC2S_Request_WeaponInfo,
	
	// Client to Server Updates
	ONcC2S_Update_Character,
	ONcC2S_Update_Critical,
	
	// Server to Client ACKs
	ONcS2C_ACK_Critical_Update,
	ONcS2C_ACK_Quit,
	
	// Server to Client Info
	ONcS2C_Info_Character,
	ONcS2C_Info_CharacterCreate,
	ONcS2C_Info_Game,
	
	// Server to Client Reject
	ONcS2C_Reject_Join,
	
	// Server to Client Updates
	ONcS2C_Update_Character,
	ONcS2C_Update_Critical,
	ONcS2C_Update_Weapon,
	
	// FindServer
	ONcC2S_Request_ServerInfo,
	ONcS2C_ServerInfo
};

// ----------------------------------------------------------------------
enum
{
	ONcNet_CU_None,				// this starts the count
	ONcNet_CU_Health,
	ONcNet_CU_NumKills,
	ONcNet_CU_DamageInflicted,
	ONcNet_CU_Inventory,
	ONcNet_CU_Name,
	ONcNet_CU_Class,
	ONcNet_CU_Spawn,
	ONcNet_CU_Gone,
	
	ONcNet_NumCUpdates
};

// ----------------------------------------------------------------------
enum
{
	ONcNet_WU_None,				// this starts the count
	ONcNet_WU_Create,
	ONcNet_WU_Delete,
	ONcNet_WU_Ammo,
	ONcNet_WU_Position,
	
	ONcNet_NumWUpdates
};

// ======================================================================
// typedefs
// ======================================================================
// ----------------------------------------------------------------------
// NOTE:  All of these structs must have a sizeof() that is divisible by 4 
// ----------------------------------------------------------------------
typedef struct ONtNet_TwoUns16
{
	UUtUns16				uns16_0;
	UUtUns16				uns16_1;
	
} ONtNet_TwoUns16;

typedef struct ONtNet_OneUns32
{
	UUtUns32				uns32_0;
	
} ONtNet_OneUns32;

// ------------------------------
typedef ONtNet_TwoUns16		ONtNet_Ack_CriticalUpdate;
typedef ONtNet_TwoUns16		ONtNet_Ack_WeaponUpdate;
typedef ONtNet_OneUns32		ONtNet_Ack_Quit;

// ------------------------------
typedef struct ONtNet_Info_Character
{
	UUtUns16				character_index;		// 2
	UUtUns16				team_number;			// 2
	UUtUns16				anim_frame;				// 2
	
	UUtUns16				pad;					// 2 ***
	
	float					facing;					// 4
	M3tPoint3D				position;				// 12
	
	char					character_class_name[AIcMaxClassNameLen];		// 64
	char					player_name[ONcMaxPlayerNameLength];			// 32
	char					animName[ONcMaxInstNameLength];					// 32
	
} ONtNet_Info_Character;

typedef struct ONtNet_Info_CharacterCreate
{
	UUtUns32				request_id;				// 2
	UUtUns16				character_index;		// 2
	UUtUns16				pad;					// 2 ***
	float					facing;					// 4
	M3tPoint3D				position;				// 12
	
} ONtNet_Info_CharacterCreate;

typedef struct ONtNet_Info_Game
{
	UUtUns32				request_id;				// 2
	UUtUns16				player_index;			// 2
	UUtUns16				level_number;			// 2
	
} ONtNet_Info_Game;

typedef struct ONtNet_Info_Spawn
{
	float					facing;					// 4
	M3tPoint3D				position;				// 12
	
} ONtNet_Info_Spawn;

// ------------------------------
typedef ONtNet_OneUns32		ONtNet_Reject_Join;				// uns32_0 = request_id

// ------------------------------
typedef struct ONtNet_Request_CharacterCreate
{
	UUtUns32				request_id;				// 4
	UUtUns16				teamNumber;				// 2
	UUtUns16				pad;					// 2 ***
	char					characterClassName[AIcMaxClassNameLen];			// 64
	char					playerName[ONcMaxPlayerNameLength];				// 32
	
} ONtNet_Request_CharacterCreate;

typedef ONtNet_TwoUns16		ONtNet_Request_CharacterInfo;	// uns16_0 = character_index
typedef ONtNet_OneUns32		ONtNet_Request_Join;			// uns32_0 = request_id
typedef ONtNet_OneUns32		ONtNet_Request_Quit;			// uns32_0 = request_id

// ------------------------------
typedef struct ONtNet_Update_Header
{
	UUtUns16				character_index;		// 2	the index of the character being updated

	// the following data is always updated for a character
	UUtUns16				animFrame;				// 2	the current frame of the animation
	M3tPoint3D				position;				// 12	the current position of the character

	char					animName[ONcMaxInstNameLength];		// 32
	
} ONtNet_Update_Header;

typedef struct ONtNet_Update_Character
{
	ONtNet_Update_Header	hdr;
	UUtUns8					data[sizeof(ONtNet_UC_Data)];	// the updated data
	
} ONtNet_Update_Character;

// this is the minimum size of an ONtNet_Update_Character
const UUtUns32				ONcNet_Update_Character_MinSize = sizeof(ONtNet_Update_Header); 

// ------------------------------
typedef struct ONtNet_CU_Data
{
	UUtUns32			hitPoints;								// 4
	UUtUns32			numKills;								// 4
	UUtUns32			damageInflicted;						// 4
	UUtUns32			weaponIndex;							// 4
	
	ONtNet_Info_Spawn	spawnInfo;								// 16
	
	char				playerName[ONcMaxPlayerNameLength];		// 32
	char				characterClassName[AIcMaxClassNameLen];	// 64
	
	// make sure there is room for the datatypes
	ONtNet_DataType		datatypes[ONcNet_NumCUpdates];
	
} ONtNet_CU_Data;

typedef struct ONtNet_CUpdate_Header
{
	UUtUns16				character_index;		// 2	the index of the character being updated
	UUtUns16				pad;					// 2	
	
} ONtNet_CUpdate_Header;

typedef struct ONtNet_Critical_Update
{
	ONtNet_CUpdate_Header	hdr;
	UUtUns8					data[sizeof(ONtNet_CU_Data)];	// the update data
	
} ONtNet_Critical_Update;

// this is the minimum size of an ONtNet_Critical_Update
const UUtUns32				ONcNet_CUpdate_MinSize = sizeof(ONtNet_CUpdate_Header); 

// ----------------------------------------------------------------------
typedef struct ONtNet_WU_Data
{
	char					weapon_class_name[ONcMaxInstNameLength];	// 32
	M3tPoint3D				position;									// 12
	WPtAmmoGroup			ammo_group;									// 16
	
	// make sure there is room for the datatypes
	ONtNet_DataType			datatypes[ONcNet_NumWUpdates];
	
} ONtNet_WU_Data;

typedef struct ONtNet_WUpdate_Header
{
	UUtUns16				weapon_index;			// 2	the index of the weapon being updated
	UUtUns16				pad;					// 2	
	
} ONtNet_WUpdate_Header;

typedef struct ONtNet_Weapon_Update
{
	ONtNet_WUpdate_Header	hdr;
	UUtUns8					data[sizeof(ONtNet_WU_Data)];	// the update data
	
} ONtNet_Weapon_Update;

// this is the minimum size of an ONtNet_Weapon_Update
const UUtUns32				ONcNet_WUpdate_MinSize = sizeof(ONtNet_WUpdate_Header); 

typedef struct ONtNet_Inventory
{
	UUtUns16				weapons[5];
	UUtUns16				ammo;
	UUtUns16				hypo;
	UUtUns16				cell;
	
} ONtNet_Inventory;

typedef ONtNet_TwoUns16		ONtNet_Request_WeaponInfo;		// uns16_0 = weapon_index

// ----------------------------------------------------------------------
typedef struct ONtNet_inAir
{
	UUtUns16				numFramesInAir;
	UUtUns16				flags;
